IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_test_error_regs.xml
<module id="TEST_ERROR_REGS" HW_revision="" description="TEST ERROR Registers">
	<register id="CPU_RAM_TEST_ERROR_STS" width="32" page="1" offset="0x0" internal="0" description="Ram Test: Error Status Register">
		<bitfield id="COR_ERROR" description="COR_ERROR flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="UNC_ERROR" description="UNC_ERROR flag" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="CPU_RAM_TEST_ERROR_STS_CLR" width="32" page="1" offset="0x2" internal="0" description="Ram Test: Error Status Clear Register">
		<bitfield id="COR_ERROR" description="COR_ERROR flag clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="UNC_ERROR" description="UNC_ERROR flag clear bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU_RAM_TEST_ERROR_ADDR" width="32" page="1" offset="0x4" internal="0" description="Ram Test: Error address register">
		<bitfield id="ADDR" description="Address which generated the error in the RAM/ROM TEST modes." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
